#### InstanceVoidCutUtils Members

---

|  |
| --- |
| InstanceVoidCutUtils Class   Methods   See Also |

The  InstanceVoidCutUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AddInstanceVoidCut | Add a cut to an element using the unattached voids inside a cutting instance. |
| Public method Static member | CanBeCutWithVoid | Indicates if the element can be cut by an instance with unattached voids. |
| Public method Static member | GetCuttingVoidInstances | Return ids of the instances with unattached voids cutting the element. |
| Public method Static member | GetElementsBeingCut | Return ids of the elements being cut by the instance |
| Public method Static member | InstanceVoidCutExists | Check whether the instance is cutting the element |
| Public method Static member | IsVoidInstanceCuttingElement | Indicates if the element is a family instance with unattached voids that can cut other elements. |
| Public method Static member | RemoveInstanceVoidCut | Remove a cut applied to the element by a cutting instance with unattached voids. |

# See Also

InstanceVoidCutUtils Class

Autodesk.Revit.DB Namespace